; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
; Reference Paper: Scala, Enrico, Patrik Haslum, Sylvie Thiébaux, and Miquel Ramirez. 
;                  "Subgoaling techniques for satisficing and optimal numeric planning." 
;                  Journal of Artificial Intelligence Research 68 (2020): 691-752. 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; The Sailing domain models a number of sailing boats 
; whose task is to rescue people in an unbounded area of the ocean. 
; The positions of the boat and people to be rescued are described by their 2D coordinates.
; The model tries to take into account the different speeds that can be obtained in a sailing boat. 
; Going upwind or fully downwind is slower. We assume that wind comes from the north.

(define (domain sailing)
    (:types boat - object person - object)
    (:predicates 
        (saved ?t - person)
    )
    (:functions
        (x ?b - boat)
        (y ?b - boat)
        (d ?t - person)
    )
    ;; Increment the value in the given counter by one
    (:action go_north_east
         :parameters (?b - boat)

         :effect (and(increase (x ?b) 1.5) (increase (y ?b) 1.5))
    )
    (:action go_north_west
         :parameters (?b - boat)

         :effect (and(decrease (x ?b) 1.5) (increase (y ?b) 1.5))
    )
    (:action go_est
         :parameters (?b - boat)

         :effect (and(increase (x ?b) 3))
    )
    (:action go_west
         :parameters (?b - boat)

         :effect (and(decrease (x ?b) 3))
    )
    (:action go_south_west
         :parameters(?b - boat)

         :effect (and(increase (x ?b) 2) (decrease (y ?b) 2))
    )
    (:action go_south_east
         :parameters(?b - boat)

         :effect (and(decrease (x ?b) 2) (decrease (y ?b) 2))
    )
    (:action go_south
         :parameters(?b - boat)

         :effect (and (decrease (y ?b) 2))
    )
    (:action save_person
        :parameters(?b - boat ?t - person)
        :precondition ( and  (>= (+ (x ?b) (y ?b)) (d ?t)) 
                             (>= (- (y ?b) (x ?b)) (d ?t)) 
                             (<= (+ (x ?b) (y ?b)) (+ (d ?t) 25)) 
                             (<= (- (y ?b) (x ?b)) (+ (d ?t) 25))
                      )
        :effect (and(saved ?t))
    )

)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_3_9)

	(:domain sailing)

	(:objects
		b0 b1 b2 - boat
		p0 p1 p2 p3 p4 p5 p6 p7 p8 - person
	)

  (:init
		(= (x b0) 9)
(= (y b0) 0)
(= (x b1) 8)
(= (y b1) 0)
(= (x b2) 4)
(= (y b2) 0)

		(= (d p0) 1)
(= (d p1) 1)
(= (d p2) 0)
(= (d p3) 1)
(= (d p4) 0)
(= (d p5) 2)
(= (d p6) 2)
(= (d p7) 1)
(= (d p8) 1)

	)

	(:goal
		(and
			(saved p0)
(saved p1)
(saved p2)
(saved p3)
(saved p4)
(saved p5)
(saved p6)
(saved p7)
(saved p8)
		)
	)
)

; plan
1. (go_north_west b1)
   changed: (x b1) from 8 to 6.5, (y b1) from 0 to 1.5
   goals met: 0 of 9
2. (go_north_west b0)
   changed: (x b0) from 9 to 7.5, (y b0) from 0 to 1.5
   goals met: 0 of 9
3. (go_north_west b0)
   changed: (x b0) from 7.5 to 6, (y b0) from 1.5 to 3
   goals met: 0 of 9
4. (go_north_west b0)
   changed: (x b0) from 6 to 4.5, (y b0) from 3 to 4.5
   goals met: 0 of 9
5. (save_person b0 p2)
   added: (saved p2)
   goals met: 1 of 9
6. (save_person b0 p4)
   added: (saved p4)
   goals met: 2 of 9
7. (go_north_west b0)
   changed: (x b0) from 4.5 to 3, (y b0) from 4.5 to 6
   goals met: 2 of 9
8. (save_person b0 p0)
   added: (saved p0)
   goals met: 3 of 9
9. (save_person b0 p1)
   added: (saved p1)
   goals met: 4 of 9
10. (save_person b0 p3)
   added: (saved p3)
   goals met: 5 of 9
11. (save_person b0 p5)
   added: (saved p5)
   goals met: 6 of 9
12. (save_person b0 p6)
   added: (saved p6)
   goals met: 7 of 9
13. (save_person b0 p7)
   added: (saved p7)
   goals met: 8 of 9
14. (save_person b0 p8)
   added: (saved p8)
   goals met: 9 of 9
